#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main() {
////赋值运算符:=,+=,-=,/=,*=,!=,>>=,<==
////单目操作符:
////	!
	//算术运算符:+,-,*,/
	//int s = 5 / 2;
	////移位运算符;>>,<<    2进制存储位置数字,左右移动,
	//int r = 1;
	//printf("%d\n", r);
	//int u = r >> 3;
	//printf("%d\n", u);
	//位操作符:&(与),|(或),^(异)   针对两个二进制位对应的数!
	/*&:一假则假(1为真,0为假)
	|:一真则真
	^:相反*/
//逻辑运算符:
	/*&&:与
	||:或*/





//
//	return 0;
//}
//结果数值加1,变复数:~
//int main() {
//	int s = 3;
//	int u = ~s;
//	printf("%d\n", u);
//	return 0;
//}
// 

//取地址符:&
//++;--:的区别一次加减一
//a++;表示先使用,后++
//++a:先+++,后使用

